app/views/movies/_form.html.erb

    <%= form.label :director_id %>
    <%= form.select :director_id, options_for_select(Director.all.map{|s|[s.first_name + " " + s.last_name, s.id]}), id: :movie_director_id %>
---
SELECT "directors".* FROM "directors"

    <%= form.label :address_id %>
    <%= form.select :address_id, options_for_select(Address.all.map{|s|["Street: " + s.street + " Zipcode: " + s.zipcode, s.id]}), id: :movie_address_id %>
---
SELECT "addresses".* FROM "addresses"