app/views/movies/index.html.erb

SELECT  "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <td><%= movie.duration %></td>
        <td><%= movie.director.first_name + " " + movie.director.last_name %></td>