app/views/movies/show.html.erb

  <strong>Director:</strong>
  <%= @movie.director.first_name + " " + @movie.director.last_name %>
---
SELECT  "directors".* FROM "directors" WHERE "directors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]