app/views/actor_movies/_form.html.erb

SELECT "actors"."id" FROM "actors"
---
    <%= form.label :actor_id %>
    <%= form.select :actor_id, options_for_select(Actor.all.map{|s|[s.first_name + " " + s.last_name, s.id]}), id: :actor_movie_actor_id %>

SELECT "movies".* FROM "movies"
---
    <%= form.label :movie_id %>
    <%= form.select :movie_id, options_for_select(Movie.all.map{|s|[s.title , s.id]}), id: :actor_movie_movie_id %>