app/views/actor_movies/index.html.erb

        <td><%= actor_movie.role %></td>
        <td><%= actor_movie.actor.first_name + " " + actor_movie.actor.last_name %></td>
---
SELECT  "actors".* FROM "actors" WHERE "actors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]