app/views/actor_movies/show.html.erb

SELECT  "actors".* FROM "actors" WHERE "actors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <strong>Actor:</strong>
  <%= @actor_movie.actor.first_name + " " + @actor_movie.actor.last_name %>